In [1]:
##############################################
#  Author:  Kevin Krause
#  KU Data Analytics Bootcamp
#  Module 3 Challenge - Pandas Challenge
#           District Student and Student Data
#  Due Date:  April 27, 2023
##############################################

In [2]:
# Establish dependencies and Initial File Setup

# pandas dependency
import pandas as pd
from pathlib import Path
import numpy as np


# File to Load (Remember to Change These)
school_data_to_load = Path("Resources/schools_complete.csv")
student_data_to_load = Path("Resources/students_complete.csv")
temp_output = Path("Resources/temporary_working_data.csv")

# Read School and Student Data File and store into Pandas DataFrames
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
all_school_data_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
all_school_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [3]:
# Calculate the total number of unique schools
count_of_unique_schools = all_school_data_df["school_name"].nunique()
count_of_unique_schools

15

In [4]:
# Calculate the total number of students
district_student_count = all_school_data_df.shape[0]
district_student_count

39170

In [5]:
## Calculate the total budget for all schools in the district
district_total_budget = school_data_df["budget"].sum()
district_total_budget

24649428

In [6]:
## Calculate the average math score for all of the students in the district
district_Average_Math_Score = student_data_df["math_score"].mean()
district_Average_Math_Score

78.98537145774827

In [7]:
## Calculate the average reading score for all of the students in the district
district_Average_Reading_Score = student_data_df["reading_score"].mean()
district_Average_Reading_Score

81.87784018381414

In [8]:
## the percentage of students that passed math
passing_math_count = all_school_data_df[
    (all_school_data_df["math_score"] >= 70)
].count()["student_name"]
passing_math_count
passing_math_student_pct = (passing_math_count / district_student_count) * 100
passing_math_student_pct

74.9808526933878

In [9]:
## the percentage of students that passed math
passing_reading_count = all_school_data_df[
    (all_school_data_df["reading_score"] >= 70)
].count()["student_name"]
passing_reading_count
passing_reading_student_pct = (passing_reading_count / district_student_count) * 100
passing_reading_student_pct

85.80546336482001

In [10]:
passing_math_reading_count = all_school_data_df[
    (all_school_data_df["math_score"] >= 70) & (all_school_data_df["reading_score"] >= 70)
].count()["student_name"]
overall_passing_pct = passing_math_reading_count /  float(district_student_count) * 100
overall_passing_pct

65.17232575950983

In [11]:
# Create a high-level snapshot of the district's key metrics in a DataFrame
#
#district_student_count = district_student_count.map("{:,}".format)

district_summary_data = {'Total Schools':[district_student_count],
                         'Total Students':[district_student_count],
                         'Total Budget':[district_total_budget],
                         'Average Math Score':[district_Average_Math_Score],
                         'Averate Reading Score':[district_Average_Reading_Score],
                         '%Passing Math':[passing_math_student_pct],
                         '%Passing Reading':[passing_reading_student_pct],
                         '%Overall Passing':[overall_passing_pct]
                        }
district_summary_df = pd.DataFrame(data=district_summary_data)

district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Averate Reading Score,%Passing Math,%Passing Reading,%Overall Passing
0,39170,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

In [12]:
#School types
school_types_df = school_data_df[['school_name','type']].sort_values('school_name')
school_types_df

              school_name      type
7      Bailey High School  District
6     Cabrera High School   Charter
1    Figueroa High School  District
13       Ford High School  District
4     Griffin High School   Charter
3   Hernandez High School  District
8      Holden High School   Charter
0       Huang High School  District
12    Johnson High School  District
9        Pena High School   Charter
11  Rodriguez High School  District
2     Shelton High School   Charter
14     Thomas High School   Charter
5      Wilson High School   Charter
10     Wright High School   Charter

In [13]:
# Total Students per School  ????
students_per_school_df = all_school_data_df.school_name.value_counts()
students_per_school_df = students_per_school_df.reset_index()
students_per_school_df = students_per_school_df.rename(columns={"index":"school_name","school_name":"population"})
students_per_school_df

              school_name  population
0      Bailey High School        4976
1     Johnson High School        4761
2   Hernandez High School        4635
3   Rodriguez High School        3999
4    Figueroa High School        2949
5       Huang High School        2917
6        Ford High School        2739
7      Wilson High School        2283
8     Cabrera High School        1858
9      Wright High School        1800
10    Shelton High School        1761
11     Thomas High School        1635
12    Griffin High School        1468
13       Pena High School         962
14     Holden High School         427

In [14]:
#budget per school
school_budgets_df = school_data_df[['school_name','budget']].sort_values('school_name')
school_budgets_df

              school_name   budget
7      Bailey High School  3124928
6     Cabrera High School  1081356
1    Figueroa High School  1884411
13       Ford High School  1763916
4     Griffin High School   917500
3   Hernandez High School  3022020
8      Holden High School   248087
0       Huang High School  1910635
12    Johnson High School  3094650
9        Pena High School   585858
11  Rodriguez High School  2547363
2     Shelton High School  1056600
14     Thomas High School  1043130
5      Wilson High School  1319574
10     Wright High School  1049400

In [15]:
#Merge school_budgets df and students per school to use to calculate per student budget below
all_budget_data_df = pd.merge(school_budgets_df, students_per_school_df, how="left", on=["school_name", "school_name"]).sort_values('school_name')
all_budget_data_df

              school_name   budget  population
0      Bailey High School  3124928        4976
1     Cabrera High School  1081356        1858
2    Figueroa High School  1884411        2949
3        Ford High School  1763916        2739
4     Griffin High School   917500        1468
5   Hernandez High School  3022020        4635
6      Holden High School   248087         427
7       Huang High School  1910635        2917
8     Johnson High School  3094650        4761
9        Pena High School   585858         962
10  Rodriguez High School  2547363        3999
11    Shelton High School  1056600        1761
12     Thomas High School  1043130        1635
13     Wilson High School  1319574        2283
14     Wright High School  1049400        1800

In [16]:
#using the merged data above calculate and display budget per student
  
for index, row in all_budget_data_df.iterrows():
    all_budget_data_df['Per_Student_Budget'] = all_budget_data_df.budget/all_budget_data_df.population
   
all_budget_data_df

              school_name   budget  population  Per_Student_Budget
0      Bailey High School  3124928        4976               628.0
1     Cabrera High School  1081356        1858               582.0
2    Figueroa High School  1884411        2949               639.0
3        Ford High School  1763916        2739               644.0
4     Griffin High School   917500        1468               625.0
5   Hernandez High School  3022020        4635               652.0
6      Holden High School   248087         427               581.0
7       Huang High School  1910635        2917               655.0
8     Johnson High School  3094650        4761               650.0
9        Pena High School   585858         962               609.0
10  Rodriguez High School  2547363        3999               637.0
11    Shelton High School  1056600        1761               600.0
12     Thomas High School  1043130        1635               638.0
13     Wilson High School  1319574        2283               578.0
14     Wright High School  1049400        1800               583.0

In [17]:
# Calculate the average math test scores per school
all_math_scores = all_school_data_df.groupby('school_name')['math_score'].mean().to_frame('AvG_Math_Score').reset_index()
all_math_scores

              school_name  AvG_Math_Score
0      Bailey High School       77.048432
1     Cabrera High School       83.061895
2    Figueroa High School       76.711767
3        Ford High School       77.102592
4     Griffin High School       83.351499
5   Hernandez High School       77.289752
6      Holden High School       83.803279
7       Huang High School       76.629414
8     Johnson High School       77.072464
9        Pena High School       83.839917
10  Rodriguez High School       76.842711
11    Shelton High School       83.359455
12     Thomas High School       83.418349
13     Wilson High School       83.274201
14     Wright High School       83.682222

In [18]:
# Calculate the average reading test scores per school
all_reading_scores = all_school_data_df.groupby('school_name')['reading_score'].mean().to_frame('AvG_Reading_Score').reset_index()
all_reading_scores

              school_name  AvG_Reading_Score
0      Bailey High School          81.033963
1     Cabrera High School          83.975780
2    Figueroa High School          81.158020
3        Ford High School          80.746258
4     Griffin High School          83.816757
5   Hernandez High School          80.934412
6      Holden High School          83.814988
7       Huang High School          81.182722
8     Johnson High School          80.966394
9        Pena High School          84.044699
10  Rodriguez High School          80.744686
11    Shelton High School          83.725724
12     Thomas High School          83.848930
13     Wilson High School          83.989488
14     Wright High School          83.955000

In [19]:
# Calculate the number of students per school with math scores of 70 or higher
math_gt_70_df = all_school_data_df.loc[all_school_data_df['math_score'] > 70].value_counts('school_name').to_frame('Num_Students_Passing_Math').reset_index()
math_gt_70_df

              school_name  Num_Students_Passing_Math
0      Bailey High School                       3216
1     Johnson High School                       3040
2   Hernandez High School                       3001
3   Rodriguez High School                       2562
4      Wilson High School                       2076
5    Figueroa High School                       1880
6       Huang High School                       1847
7        Ford High School                       1801
8     Cabrera High School                       1664
9      Wright High School                       1625
10    Shelton High School                       1583
11     Thomas High School                       1475
12    Griffin High School                       1317
13       Pena High School                        882
14     Holden High School                        387

In [20]:
# Calculate the number of students per school with reading scores of 70 or higher
reading_gt_70_df = all_school_data_df.loc[all_school_data_df['reading_score'] > 70].value_counts('school_name').to_frame('Num_Students_Passing_Reading').reset_index()
reading_gt_70_df

              school_name  Num_Students_Passing_Reading
0      Bailey High School                          3946
1     Johnson High School                          3727
2   Hernandez High School                          3624
3   Rodriguez High School                          3109
4    Figueroa High School                          2313
5       Huang High School                          2299
6      Wilson High School                          2129
7        Ford High School                          2123
8     Cabrera High School                          1744
9      Wright High School                          1682
10    Shelton High School                          1631
11     Thomas High School                          1519
12    Griffin High School                          1371
13       Pena High School                           887
14     Holden High School                           396

In [21]:
# Use the provided code to calculate the number of students per school 
# that passed both math and reading with scores of 70 or higher

students_passing_math_and_reading = all_school_data_df[
    (all_school_data_df["reading_score"] >= 70) & (all_school_data_df["math_score"] >= 70)
]
school_students_passing_math_and_reading = students_passing_math_and_reading.groupby(["school_name"]).size().to_frame('Num_Passing_RandM').reset_index()
school_students_passing_math_and_reading

              school_name  Num_Passing_RandM
0      Bailey High School               2719
1     Cabrera High School               1697
2    Figueroa High School               1569
3        Ford High School               1487
4     Griffin High School               1330
5   Hernandez High School               2481
6      Holden High School                381
7       Huang High School               1561
8     Johnson High School               2549
9        Pena High School                871
10  Rodriguez High School               2119
11    Shelton High School               1583
12     Thomas High School               1487
13     Wilson High School               2068
14     Wright High School               1626

In [22]:
# Ccalculate the passing rates
all_passing_rates1 = pd.merge(students_per_school_df,math_gt_70_df,
                             how="left",on=["school_name", "school_name"]).sort_values('school_name')
all_passing_rates2 = pd.merge(all_passing_rates1,reading_gt_70_df,
                             how="left",on=["school_name", "school_name"]).sort_values('school_name')
all_passing_rates_df = pd.merge(all_passing_rates2,school_students_passing_math_and_reading,
                             how="left",on=["school_name", "school_name"]).sort_values('school_name')
all_passing_rates_df

,school_name,population,Num_Students_Passing_Math,Num_Students_Passing_Reading,Num_Passing_RandM
0,Bailey High School,4976,3216,3946,2719
1,Cabrera High School,1858,1664,1744,1697
2,Figueroa High School,2949,1880,2313,1569
3,Ford High School,2739,1801,2123,1487
4,Griffin High School,1468,1317,1371,1330
5,Hernandez High School,4635,3001,3624,2481
6,Holden High School,427,387,396,381
7,Huang High School,2917,1847,2299,1561
8,Johnson High School,4761,3040,3727,2549
9,Pena High School,962,882,887,871
10,Rodriguez High School,3999,2562,3109,2119
11,Shelton High School,1761,1583,1631,1583
12,Thomas High School,1635,1475,1519,1487
13,Wilson High School,2283,2076,2129,2068
14,Wright High School,1800,1625,1682,1626

In [23]:
##calculate the passing rates

for index, row in all_passing_rates_df.iterrows():
    all_passing_rates_df['%_Pass_Math'] = (all_passing_rates_df.Num_Students_Passing_Math/all_passing_rates_df.population) * 100
    all_passing_rates_df['%_Pass_Reading'] = (all_passing_rates_df.Num_Students_Passing_Reading/all_passing_rates_df.population) * 100
    all_passing_rates_df['%_Overall_Passing'] = (all_passing_rates_df.Num_Passing_RandM/all_passing_rates_df.population) * 100
    
all_passing_rates_df

,school_name,population,Num_Students_Passing_Math,Num_Students_Passing_Reading,Num_Passing_RandM,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
0,Bailey High School,4976,3216,3946,2719,64.630225,79.300643,54.642283
1,Cabrera High School,1858,1664,1744,1697,89.558665,93.864370,91.334769
2,Figueroa High School,2949,1880,2313,1569,63.750424,78.433367,53.204476
3,Ford High School,2739,1801,2123,1487,65.753925,77.510040,54.289887
4,Griffin High School,1468,1317,1371,1330,89.713896,93.392371,90.599455
5,Hernandez High School,4635,3001,3624,2481,64.746494,78.187702,53.527508
6,Holden High School,427,387,396,381,90.632319,92.740047,89.227166
7,Huang High School,2917,1847,2299,1561,63.318478,78.813850,53.513884
8,Johnson High School,4761,3040,3727,2549,63.852132,78.281874,53.539172
9,Pena High School,962,882,887,871,91.683992,92.203742,90.540541
10,Rodriguez High School,3999,2562,3109,2119,64.066017,77.744436,52.988247
11,Shelton High School,1761,1583,1631,1583,89.892107,92.617831,89.892107
12,Thomas High School,1635,1475,1519,1487,90.214067,92.905199,90.948012
13,Wilson High School,2283,2076,2129,2068,90.932983,93.254490,90.582567
14,Wright High School,1800,1625,1682,1626,90.277778,93.444444,90.333333

In [24]:
#  Summary Dataframe of all school data collected and calculated

per_school_summ1 = pd.merge(school_types_df[['school_name','type']],
                            all_budget_data_df[['school_name','population','budget','Per_Student_Budget']],
                            on=["school_name", "school_name"])

per_school_summ2 = pd.merge(per_school_summ1[['school_name','type','population','budget','Per_Student_Budget']],
                            all_math_scores[['school_name','AvG_Math_Score']],
                            on=["school_name", "school_name"])

per_school_summ3 = pd.merge(per_school_summ2[['school_name','type','population','budget','Per_Student_Budget','AvG_Math_Score']],
                            all_reading_scores[['school_name','AvG_Reading_Score']],
                            on=["school_name", "school_name"])

per_school_summary = pd.merge(per_school_summ3[['school_name','type','population','budget','Per_Student_Budget','AvG_Math_Score','AvG_Reading_Score']],
                            all_passing_rates_df[['school_name','%_Pass_Math','%_Pass_Reading','%_Overall_Passing']],
                            on=["school_name", "school_name"])

per_school_summary

,school_name,type,population,budget,Per_Student_Budget,AvG_Math_Score,AvG_Reading_Score,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,64.630225,79.300643,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,89.558665,93.864370,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,63.750424,78.433367,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,65.753925,77.510040,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,89.713896,93.392371,90.599455
5,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,64.746494,78.187702,53.527508
6,Holden High School,Charter,427,248087,581.0,83.803279,83.814988,90.632319,92.740047,89.227166
7,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,63.318478,78.813850,53.513884
8,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,63.852132,78.281874,53.539172
9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,91.683992,92.203742,90.540541
10,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,64.066017,77.744436,52.988247
11,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,89.892107,92.617831,89.892107
12,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,90.214067,92.905199,90.948012
13,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,90.932983,93.254490,90.582567
14,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,90.277778,93.444444,90.333333

In [25]:
# Sort the schools by `% Overall Passing` in descending order and display the top 5 rows.
top_schools = per_school_summary.sort_values(by='%_Overall_Passing',ascending=False)
top_schools.head(5)

,school_name,type,population,budget,Per_Student_Budget,AvG_Math_Score,AvG_Reading_Score,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,89.558665,93.864370,91.334769
12,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,90.214067,92.905199,90.948012
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,89.713896,93.392371,90.599455
13,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,90.932983,93.254490,90.582567
9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,91.683992,92.203742,90.540541

In [26]:
bottom_schools = per_school_summary.sort_values(by='%_Overall_Passing',ascending=True)
bottom_schools.head(5)

,school_name,type,population,budget,Per_Student_Budget,AvG_Math_Score,AvG_Reading_Score,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
10,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,64.066017,77.744436,52.988247
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,63.750424,78.433367,53.204476
7,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,63.318478,78.813850,53.513884
5,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,64.746494,78.187702,53.527508
8,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,63.852132,78.281874,53.539172

In [27]:
# Use the code provided to separate the math data by grade
ninth_graders = all_school_data_df[(all_school_data_df["grade"] == "9th")]
tenth_graders = all_school_data_df[(all_school_data_df["grade"] == "10th")]
eleventh_graders = all_school_data_df[(all_school_data_df["grade"] == "11th")]
twelfth_graders = all_school_data_df[(all_school_data_df["grade"] == "12th")]


# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grade_math_scores = ninth_graders.groupby('school_name')['math_score'].mean().to_frame('Ninth_Math_Score').reset_index()
tenth_grade_math_scores = tenth_graders.groupby('school_name')['math_score'].mean().to_frame('Tenth_Math_Score').reset_index()
eleventh_grade_math_scores = eleventh_graders.groupby('school_name')['math_score'].mean().to_frame('Eleventh_Math_Score').reset_index()
twelfth_grade_math_scores = twelfth_graders.groupby('school_name')['math_score'].mean().to_frame('Twelfth_Math_Score').reset_index()

# Merge into one data frame
math_scores_by_grade1 = pd.merge(ninth_grade_math_scores,tenth_grade_math_scores,on=["school_name", "school_name"])
math_scores_by_grade2 = pd.merge(math_scores_by_grade1,eleventh_grade_math_scores,on=["school_name", "school_name"])
math_scores_by_grade = pd.merge(math_scores_by_grade2,twelfth_grade_math_scores,on=["school_name", "school_name"])

#display math scores by grade
math_scores_by_grade

,school_name,Ninth_Math_Score,Tenth_Math_Score,Eleventh_Math_Score,Twelfth_Math_Score
0,Bailey High School,77.083676,76.996772,77.515588,76.492218
1,Cabrera High School,83.094697,83.154506,82.765560,83.277487
2,Figueroa High School,76.403037,76.539974,76.884344,77.151369
3,Ford High School,77.361345,77.672316,76.918058,76.179963
4,Griffin High School,82.044010,84.229064,83.842105,83.356164
5,Hernandez High School,77.438495,77.337408,77.136029,77.186567
6,Holden High School,83.787402,83.429825,85.000000,82.855422
7,Huang High School,77.027251,75.908735,76.446602,77.225641
8,Johnson High School,77.187857,76.691117,77.491653,76.863248
9,Pena High School,83.625455,83.372000,84.328125,84.121547
10,Rodriguez High School,76.859966,76.612500,76.395626,77.690748
11,Shelton High School,83.420755,82.917411,83.383495,83.778976
12,Thomas High School,83.590022,83.087886,83.498795,83.497041
13,Wilson High School,83.085578,83.724422,83.195326,83.035794
14,Wright High School,83.264706,84.010288,83.836782,83.644986

In [28]:
# Use the code provided to separate the reading data by grade
ninth_graders = all_school_data_df[(all_school_data_df["grade"] == "9th")]
tenth_graders = all_school_data_df[(all_school_data_df["grade"] == "10th")]
eleventh_graders = all_school_data_df[(all_school_data_df["grade"] == "11th")]
twelfth_graders = all_school_data_df[(all_school_data_df["grade"] == "12th")]


# Group by `school_name` and take the mean of the `reading_score` column for each.
ninth_grade_reading_scores = ninth_graders.groupby('school_name')['reading_score'].mean().to_frame('Ninth_reading_Score').reset_index()
tenth_grade_reading_scores = tenth_graders.groupby('school_name')['reading_score'].mean().to_frame('Tenth_reading_Score').reset_index()
eleventh_grade_reading_scores = eleventh_graders.groupby('school_name')['reading_score'].mean().to_frame('Eleventh_reading_Score').reset_index()
twelfth_grade_reading_scores = twelfth_graders.groupby('school_name')['reading_score'].mean().to_frame('Twelfth_reading_Score').reset_index()

# Merge into one data frame
reading_scores_by_grade1 = pd.merge(ninth_grade_reading_scores,tenth_grade_reading_scores,on=["school_name", "school_name"])
reading_scores_by_grade2 = pd.merge(reading_scores_by_grade1,eleventh_grade_reading_scores,on=["school_name", "school_name"])
reading_scores_by_grade = pd.merge(reading_scores_by_grade2,twelfth_grade_reading_scores,on=["school_name", "school_name"])

#display reading scores by grade
reading_scores_by_grade

,school_name,Ninth_reading_Score,Tenth_reading_Score,Eleventh_reading_Score,Twelfth_reading_Score
0,Bailey High School,81.303155,80.907183,80.945643,80.912451
1,Cabrera High School,83.676136,84.253219,83.788382,84.287958
2,Figueroa High School,81.198598,81.408912,80.640339,81.384863
3,Ford High School,80.632653,81.262712,80.403642,80.662338
4,Griffin High School,83.369193,83.706897,84.288089,84.013699
5,Hernandez High School,80.866860,80.660147,81.396140,80.857143
6,Holden High School,83.677165,83.324561,83.815534,84.698795
7,Huang High School,81.290284,81.512386,81.417476,80.305983
8,Johnson High School,81.260714,80.773431,80.616027,81.227564
9,Pena High School,83.807273,83.612000,84.335938,84.591160
10,Rodriguez High School,80.993127,80.629808,80.864811,80.376426
11,Shelton High School,84.122642,83.441964,84.373786,82.781671
12,Thomas High School,83.728850,84.254157,83.585542,83.831361
13,Wilson High School,83.939778,84.021452,83.764608,84.317673
14,Wright High School,83.833333,83.812757,84.156322,84.073171

In [29]:
################################# SCORES BY SCHOOL SPENDING #################################

In [30]:
#scores by school binning
spending_bins = [0, 585, 630, 645, 680]
labels = ["<$585", "$585-630", "$630-645", "$645-680"]

In [31]:
# Create a copy of the school summary since it has the "Per Student Budget" 
school_spending_df = per_school_summary.copy()
school_spending_df

,school_name,type,population,budget,Per_Student_Budget,AvG_Math_Score,AvG_Reading_Score,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,64.630225,79.300643,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,89.558665,93.864370,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,63.750424,78.433367,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,65.753925,77.510040,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,89.713896,93.392371,90.599455
5,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,64.746494,78.187702,53.527508
6,Holden High School,Charter,427,248087,581.0,83.803279,83.814988,90.632319,92.740047,89.227166
7,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,63.318478,78.813850,53.513884
8,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,63.852132,78.281874,53.539172
9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,91.683992,92.203742,90.540541
10,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,64.066017,77.744436,52.988247
11,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,89.892107,92.617831,89.892107
12,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,90.214067,92.905199,90.948012
13,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,90.932983,93.254490,90.582567
14,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,90.277778,93.444444,90.333333

In [32]:
# Use `pd.cut` to categorize spending based on the bins.
school_spending_df["Spending Ranges (Per Student)"] = 
school_spending_df

SyntaxError: invalid syntax (416621729.py, line 2)

In [33]:
#  Calculate averages for the desired columns. 
#spending_math_scores = school_spending_df.groupby(["Spending_bins (Per_Student_Budget)"])["AvG_Math_Score"].mean()
#spending_reading_scores = school_spending_df.groupby(["Spending Ranges (Per Student)"])["Average Reading Score"].mean()
#spending_passing_math = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Math"].mean()
#spending_passing_reading = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Reading"].mean()
#overall_passing_spending = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Overall Passing"].mean()

In [34]:
################################# SCORES BY SCHOOL SIZE #################################

In [35]:
################################# SCORES BY SCHOOL TYPE  #######################################

In [36]:
math_scores_by_type = per_school_summary.groupby(['type']).mean('AvG_Math_Score')
math_scores_by_type

,population,budget,Per_Student_Budget,AvG_Math_Score,AvG_Reading_Score,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
type,,,,,,,,
Charter,1524.250000,9.126881e+05,599.500000,83.473852,83.896421,90.363226,93.052812,90.432244
District,3853.714286,2.478275e+06,643.571429,76.956733,80.966636,64.302528,78.324559,53.672208

In [37]:
reading_scores_by_type = per_school_summary.groupby(["type"]).mean('AvG_Reading_Score')
reading_scores_by_type

,population,budget,Per_Student_Budget,AvG_Math_Score,AvG_Reading_Score,%_Pass_Math,%_Pass_Reading,%_Overall_Passing
type,,,,,,,,
Charter,1524.250000,9.126881e+05,599.500000,83.473852,83.896421,90.363226,93.052812,90.432244
District,3853.714286,2.478275e+06,643.571429,76.956733,80.966636,64.302528,78.324559,53.672208